const news =
[
  {
    id: 1,
    title: '團圓飯哪裡吃？　韓國瑜：除夕沉澱心情陪家人',
    description: '今天(23日)是小年夜，也是過年連續假期的第一天，不過高雄市長韓國瑜卻繼續上班，上午率隊視察左營蓮池潭風景區，拚在地觀光，替即將到來的春節出遊潮把關環境，也透露年假會回北部陪家人沈澱休息，他從除夕休到初三，初四上工發紅包。高雄市長韓國瑜vs.當地人員：「裡面有24孝，我們都照古禮。」小年夜韓市長扮演...',
    content: '今天(23日)是小年夜，也是過年連續假期的第一天，不過高雄市長韓國瑜卻繼續上班，上午率隊視察左營蓮池潭風景區，拚在地觀光，替即將到來的春節出遊潮把關環境，也透露年假會回北部陪家人沈澱休息，他從除夕休到初三，初四上工發紅包。高雄市長韓國瑜vs.當地人員：「裡面有24孝，我們都照古禮。」小年夜韓市長扮演觀光大使，來到春秋閣，先走一趟龍虎塔。高雄市長韓國瑜：「入龍頭出虎尾，原來是有意義的。」龍頭進虎尾出，除掉去年壞運勢，韓國瑜親自出馬，要hold住高雄旅遊品質，徒步視察蓮池潭，一下車還檢查公廁乾不乾淨，小年夜拚觀光，韓市長漫步在蓮池潭風景區，大家好奇市長過年休幾天，會在哪裡吃團圓飯。高雄市長韓國瑜：「沉澱一下，陪陪家人，長輩住在北部，就陪長輩吃年夜飯，但是我們高雄市都有留守，全職勤務表都已經排出來了，所以24小時每一天，都有一個副市長級的留守。」邊品嘗百年老店的棋餅，透露自己年假要沉澱休息，回北部陪陪家人，也強調三位副市長都會輪值留守，他自己會提前銷假上班，攤開這幾天市府公布的行程，韓市長從除夕夜開始休假，一連休四天，初四就上工，開始發送市長紅包，而隔天大年初五，罷韓連署第二階段就要展開。高雄市長韓國瑜vs.記者：「罷韓第二階段你怎麼看，不說這個，謝謝喔，高雄市是一個欣欣向榮的城市，希望大家好朋友都來高雄走一走，大年初五開始愛河燈會，加上全世界第二條的這個塑膠廢料的藍鯨，都有非常多亮麗的景點。」卯起來推薦高雄燈會，以及新亮相的愛之鯨，對於罷免案這關鍵字，韓國瑜只聽不回，農曆年前最後一個公開行程，韓國瑜努力拚觀光，要讓市民跟業者有感，在罷韓連署開始前，交出漂亮成績。',
    href: 'https://test.com',
    pubTime: '2020/01/23 12:47',
    publisher: 'tvbs',
    intent: 'politician_say',
    intent_score: 0.999999
  },
  {
    id: 2,
    title: '快新聞／外界力拱「藍白合作」 柯文哲：藍白拖是用來打蟑螂的！',
    description: '外傳前行政院長游錫堃今（23）日晚上將與台北市長柯文哲碰面，柯文哲被媒體追問時也證實此事，但他們要聊些什麼？柯文哲坦言，游錫堃想選立院院長才會來拜會，雙方是禮尚往來，「民進黨在立院已過半，根本不需要來拜訪」。至於，是否會有「藍白合作」？柯語帶玄機地說，「藍白拖是拿來打蟑螂」，沒有蟑螂就不需要藍白拖，蟑螂是誰卻避而不答，留給外界無限想像。',
    content: '柯文哲表示，日前接到游錫堃有意來拜訪時，他曾說「不用吧，你們都單獨過半了，何必客氣？」但游錫堃基於「禮貌」，仍堅持來拜訪，他當然也是「禮尚往來」。柯文哲也直言，游錫堃有意選立院院長，才會選在此時來拜訪。至於安排自家立委與民進黨團總召柯建銘碰面，他強調，柯建銘是立院「永遠的總召」，熟悉議事規則、人脈又廣，能給予自家五名新科「菜鳥立委」指教。柯文哲說，台灣民眾黨是「不關鍵少數」，當前不需自我膨脹，必須展現「示範作用」與「學習態度」，未來也會針對不同議題跟國民黨與民進黨合作，只要議題「reasonable」（合理），都可以合作。有82%民眾黨支持者挺「藍白合作」，柯文哲直言，民主政治的特色制衡，正如孟德斯鳩的三權分立，「民主政治需要制衡」，但當前「不用為了制衡而制衡」。話鋒一轉，柯文哲說，「『藍白拖』是拿來打蟑螂用的，沒有蟑螂就不需要『藍白拖』」，至於蟑螂是誰，柯文哲卻避而不答，留給外界無限想像。（民視新聞網／綜合報導）',
    href: 'https://test.com',
    pubTime: '2020/01/23 11:32',
    publisher: 'ftv',
    intent: 'politician_say',
    intent_score: 0.999999
  },
  {
    id: 3,
    title: '北市重慶高架橋提前拆完　初三中午通車',
    description: '台北市府趁著春節期間，進行重慶南路高架橋拆除計劃，整個工程提前完成，市府也在27日中午宣布通車，不少民眾都特地拍照留念，不少人也說拆掉高架橋之後，感覺更寬闊、比較沒壓迫感，但這只是市府改建中正橋計劃的一部份，全部工程預計得到111年完成。伴著鳴笛聲，車隊繞行巡視後，台北市重慶高架橋拆除完畢，宣告正式...',
    content: '台北市府趁著春節期間，進行重慶南路高架橋拆除計劃，整個工程提前完成，市府也在27日中午宣布通車，不少民眾都特地拍照留念，不少人也說拆掉高架橋之後，感覺更寬闊、比較沒壓迫感，但這只是市府改建中正橋計劃的一部份，全部工程預計得到111年完成。伴著鳴笛聲，車隊繞行巡視後，台北市重慶高架橋拆除完畢，宣告正式通車。原本預計27日晚間十點完工，但工程進度超前，台北市政府提前到中午開放，不少民眾經過，都拿起手機拍照紀錄。民眾：「感覺空曠了許多，對市容我覺得是有正面的幫助，(以前)感覺到有壓迫感，(現在拆掉呢)，現在拆掉感覺比較開闊一點，其實車流應該都差不多，但是就是說現在道路這樣子弄的話，應該會比較好開至少它道路大，車子看起來就比較少一些。」北市府利用春節休假，採閃電戰拆橋，民眾給予肯定，擁有49年歷史的重慶高架橋，走入歷史，就是為了配合台北市府的，中正橋改建計劃。台北市副市長彭振聲：「111年的10月份可以完成，主橋的鋼構已經在製作之中，老橋我們會把拓寬的部分拆掉，把原有的川端橋的部份保留下來，以後就專供行人跟腳踏車專用。」重慶高架橋迅速拆除，周遭居民免除噪音困擾，北市府要復興中正萬華，持續改造工程，期間諸多不便，市民得再忍一忍。',
    href: 'https://test.com',
    pubTime: '2020/01/27 14:20',
    publisher: 'tvbs',
    intent: 'someone_say',
    intent_score: 0
  },
  {
    id: 4,
    title: '快新聞／確診台商隱匿病情 陳建仁：令人痛心的害人害己行為',
    description: '武漢肺炎擴散，目前台灣已確診3例，其中最新一例是隱匿旅遊史的男性台商。副總統陳建仁今（26）日在臉書發文，指出高雄一名武漢台商隱匿發燒和咳嗽資料，也未誠實交代沒戴口罩到舞廳跳舞，「這是令人痛心的害人害己行為」，呼籲所有從武漢肺炎疫區來台的台商及陸客確實配合防疫，早日根除武漢肺炎。',
    content: '武漢肺炎擴散，目前台灣已確診3例，其中最新一例是隱匿旅遊史的男性台商。副總統陳建仁今（26）日在臉書發文，指出高雄一名武漢台商隱匿發燒和咳嗽資料，也未誠實交代沒戴口罩到舞廳跳舞，「這是令人痛心的害人害己行為」，呼籲所有從武漢肺炎疫區來台的台商及陸客確實配合防疫，早日根除武漢肺炎。',
    href: 'https://test.com',
    pubTime: '2020/01/26 14:04',
    publisher: 'ftv',
    intent: 'politician_say',
    intent_score: 0.999999
  },
  {
    id: 5,
    title: '武漢肺炎防疫 蘇貞昌：民眾不需恐慌',
    description: '中國武漢肺炎疫情擴散，台灣出現首例確診病例。行政院長蘇貞昌今天表示，對於武漢肺炎防疫，政府嚴陣以待；目前國內備有超過4400萬副外科口罩、193萬副N95口罩，呼籲民眾無需恐慌。中央流行疫情指揮中心今天晚間證實，有一名台灣女性自中國大陸返台後檢驗出2019新型冠狀病毒，這是中國大陸武漢肺炎疫情擴散以...',
    content: '中國武漢肺炎疫情擴散，台灣出現首例確診病例。行政院長蘇貞昌今天表示，對於武漢肺炎防疫，政府嚴陣以待；目前國內備有超過4400萬副外科口罩、193萬副N95口罩，呼籲民眾無需恐慌。中央流行疫情指揮中心今天晚間證實，有一名台灣女性自中國大陸返台後檢驗出2019新型冠狀病毒，這是中國大陸武漢肺炎疫情擴散以...',
    href: 'https://test.com',
    pubTime: '2020/01/21 20:58',
    publisher: 'ebc',
    intent: 'politician_say',
    intent_score: 0.999999
  },
  {
    id: 6,
    title: '陳玉珍「萬安緊抱」成公敵　失控言行一籮筐',
    description: '國民黨立委陳玉珍曾因「金門豬」爭議、「萬安緊抱」引來媒體關注，不少脫序行為經常在網路上引發熱議。近日，陳玉珍與黨內同志赴外交部抗議蘇啓誠案，因推擠導致手指夾傷送醫住院，引起醫界撻伐濫用醫療資源。而過去陳玉珍的驚人之舉，也不只這一件，今年5月國民黨團為杯葛民進黨李進勇人事案霸佔立院主席台，陳玉珍抱緊立...',
    content: '國民黨立委陳玉珍曾因「金門豬」爭議、「萬安緊抱」引來媒體關注，不少脫序行為經常在網路上引發熱議。近日，陳玉珍與黨內同志赴外交部抗議蘇啓誠案，因推擠導致手指夾傷送醫住院，引起醫界撻伐濫用醫療資源。而過去陳玉珍的驚人之舉，也不只這一件，今年5月國民黨團為杯葛民進黨李進勇人事案霸佔立院主席台，陳玉珍抱緊立...',
    href: 'https://test.com',
    pubTime: '2020/01/27 15:10',
    publisher: 'ett',
    intent: 'politician',
    intent_score: 0.999708
  },
  {
    id: 7,
    title: '建議戴口罩　柯文哲：未來一周是防疫關鍵',
    description: '年後北市府第一天上班日，北市府面對疫情嚴陣以待，但要如何因應，市長柯文哲雖然要同仁戴上口罩，但表示還是要看疫情的發展，而對於民眾黨的規畫，柯文哲直言「要為執政做準備」。勞權團體：「撤換勞動局長，撤換勞動局長，勞動局長重新任命。」年後第一個上班日北市府門口聚集就勞權團體和議員，抗議柯文哲任命的新任勞動...',
    content: '年後北市府第一天上班日，北市府面對疫情嚴陣以待，但要如何因應，市長柯文哲雖然要同仁戴上口罩，但表示還是要看疫情的發展，而對於民眾黨的規畫，柯文哲直言「要為執政做準備」。勞權團體：「撤換勞動局長，撤換勞動局長，勞動局長重新任命。」年後第一個上班日北市府門口聚集就勞權團體和議員，抗議柯文哲任命的新任勞動...',
    href: 'https://test.com',
    pubTime: '2020/01/30 13:46',
    publisher: 'tvbs',
    intent: 'politician_say',
    intent_score: 0.999999
  },
  {
    id: 8,
    title: '憂心疫情升溫　台股震盪下跌逾百點',
    description: '中國調降美國商品關稅，激勵美股創新高，但亞股對武漢肺炎疫情擔憂再度燃起，台股今天開低震盪，權值股走跌，防疫概念股點火，盤中指數下跌逾百點，至11617點。中國調降美國商品關稅獲市場掌聲，華爾街股市3大指數今天全數締造新高，歐洲股市也收漲，日韓港陸等亞股均呈現弱勢。台股今天開低震盪，至11時左右，加權...',
    content: '中國調降美國商品關稅，激勵美股創新高，但亞股對武漢肺炎疫情擔憂再度燃起，台股今天開低震盪，權值股走跌，防疫概念股點火，盤中指數下跌逾百點，至11617點。中國調降美國商品關稅獲市場掌聲，華爾街股市3大指數今天全數締造新高，歐洲股市也收漲，日韓港陸等亞股均呈現弱勢。台股今天開低震盪，至11時左右，加權...',
    href: 'https://test.com',
    pubTime: '2020/02/07 11:32',
    publisher: 'tvbs',
    intent: 'someone_say',
    intent_score: 0
  },
  {
    id: 9,
    title: '紓困條例24日協商 柯建銘：好意見都不排除納入',
    description: '為因應武漢肺炎，朝野有共識儘速通過「嚴重特殊傳染性肺炎防治及紓困振興特別條例」草案，民進黨團總召柯建銘今天說，黨團立場是開放的，各黨有好意見都不排除，25日三讀應該沒問題。立法院長游錫堃24日將邀請朝野黨團協商「嚴重特殊傳染性肺炎防治及紓困振興特別條例」等草案，民進黨立法院黨團總召柯建銘今天下午在接...',
    content: '為因應武漢肺炎，朝野有共識儘速通過「嚴重特殊傳染性肺炎防治及紓困振興特別條例」草案，民進黨團總召柯建銘今天說，黨團立場是開放的，各黨有好意見都不排除，25日三讀應該沒問題。立法院長游錫堃24日將邀請朝野黨團協商「嚴重特殊傳染性肺炎防治及紓困振興特別條例」等草案，民進黨立法院黨團總召柯建銘今天下午在接...',
    href: 'https://test.com',
    pubTime: '2020/02/23 15:45',
    publisher: 'cna',
    intent: 'politician_say',
    intent_score: 0.999999
  },
  {
    id: 10,
    title: '快新聞／李登輝住院第2天感染肺炎 王燕軍：意識清楚「穩定緩慢恢復中」',
    description: '高齡98歲的前總統李登輝本月8日晚間喝牛奶嗆到，緊急送台北榮總。當時李登輝辦公室主任王燕軍受訪時表示，檢查後一切正常，不過李登輝至今仍持續住院治療中，引發外界高度關注。王燕軍在今（23 ）接受媒體採訪時，表示很謝謝大家關心前總統李登輝的身體健康，雖然被牛奶嗆到之後有變成較嚴重的肺炎以及肺部積水的現象，但一切仍在控制當中。',
    content: '高齡98歲的前總統李登輝本月8日晚間喝牛奶嗆到，緊急送台北榮總。當時李登輝辦公室主任王燕軍受訪時表示，檢查後一切正常，不過李登輝至今仍持續住院治療中，引發外界高度關注。王燕軍在今（23 ）接受媒體採訪時，表示很謝謝大家關心前總統李登輝的身體健康，雖然被牛奶嗆到之後有變成較嚴重的肺炎以及肺部積水的現象，但一切仍在控制當中。',
    href: 'https://test.com',
    pubTime: '2020/02/23 17:50',
    publisher: 'ftv',
    intent: 'politician_say',
    intent_score: 0.999999
  },
  {
    id: 11,
    title: '快新聞／再槓金溥聰！ 蔡正元狠酸金：第一號寵臣',
    description: '國民黨擬恢復花蓮縣立委傅崐萁的黨籍，引起讓黨內人士開戰。前國安會秘書長金溥聰和台北市議員徐巧芯等人反對，現任國民黨義務副秘書長蔡正元批金溥聰搞黨內鬥爭、「馬系人馬介入」。金溥聰今（18）上廣播節目，強調跟前總統馬英九無關，蔡正元中午又在臉書發文怒批金溥聰是「第一號寵臣」。',
    content: '國民黨擬恢復花蓮縣立委傅崐萁的黨籍，引起讓黨內人士開戰。前國安會秘書長金溥聰和台北市議員徐巧芯等人反對，現任國民黨義務副秘書長蔡正元批金溥聰搞黨內鬥爭、「馬系人馬介入」。金溥聰今（18）上廣播節目，強調跟前總統馬英九無關，蔡正元中午又在臉書發文怒批金溥聰是「第一號寵臣」。',
    href: 'https://test.com',
    pubTime: '2020/02/18 14:52',
    publisher: 'ftv',
    intent: 'politician_say',
    intent_score: 0.999999
  },
  {
    id: 12,
    title: 'nt12',
    description: 'nd12',
    content: 'nc12',
    href: 'nh12',
    pubTime: '2020/02/18 14:52',
    publisher: 'np12',
    intent: 'politician_say',
    intent_score: 0.999999
  },
  {
    id: 13,
    title: 'nt13',
    description: 'nd13',
    content: 'nc13',
    href: 'nh13',
    pubTime: '2020/02/18 14:52',
    publisher: 'np13',
    intent: 'politician_say',
    intent_score: 0.999999
  },
  {
    id: 14,
    title: 'nt14',
    description: 'nd14',
    content: 'nc14',
    href: 'nh14',
    pubTime: '2020/02/18 14:52',
    publisher: 'np14',
    intent: 'politician_say',
    intent_score: 0.999999
  }
];

const filtercount =
[
  {
    id: 1,
    name: '韓國瑜',
    type: 'NRP',
    count: 25,
    parent_name: '韓國瑜',
    parent_id: 1
  },
  {
    id: 2,
    name: '柯文哲',
    type: 'NRP',
    count: 20,
    parent_name: '柯文哲',
    parent_id: 2
  },
  {
    id: 3,
    name: '武漢肺炎',
    type: 'NI',
    count: 60,
    parent_name: '武漢肺炎',
    parent_id: 3
  },
  {
    id: 4,
    name: 'nt14',
    type: 'NRP',
    count: 3,
    parent_name: 'nt14',
    parent_id: 4
  }
];

const newstag =
[
  {
    id: 1,
    news_id: 1,
    tag_id: 1
  },
  {
    id: 2,
    news_id: 2,
    tag_id: 2
  },
  { // news_id 3 -> 2人同一議題
    id: 3,
    news_id: 4,
    tag_id: 1
  },
  {
    id: 4,
    news_id: 4,
    tag_id: 2
  },
  {
    id: 5,
    news_id: 4,
    tag_id: 3
  },
  { // news_id 4 & 5 同議題，不同人落在不同新聞
    id: 6,
    news_id: 5,
    tag_id: 1
  },
  {
    id: 7,
    news_id: 5,
    tag_id: 3
  },
  {
    id: 8,
    news_id: 7,
    tag_id: 2
  },
  {
    id: 9,
    news_id: 7,
    tag_id: 3
  },
  {
    id: 10,
    news_id: 14,
    tag_id: 4
  }
];

const tagverify =
[
  {
    id: 1,
    name: '韓國瑜',
    type: 'NRP',
    count: 50,
    status: 'DONE'
  },
  {
    id: 2,
    name: '柯文哲',
    type: 'NRP',
    count: 43,
    status: 'DONE'
  },
  {
    id: 3,
    name: '武漢肺炎',
    type: 'NI',
    count: 70,
    status: 'DONE'
  },
  {
    id: 4,
    name: 'nt14',
    type: 'NRP',
    count: 30,
    status: 'DONE'
  }
];

module.exports = {
  news,
  filtercount,
  newstag,
  tagverify
};
